In [1]:
# Setup dependencies Pandas, Matplotlib for charting and SQLAlchemy
import os

#import psycopg2
import pandas as pd
# matplotlib
from sqlalchemy import create_engine

from config import username_password
# Path to sqlite
#database_path = os.path.join("..", "EmployeeSQL", "Employee_Data.sqlite")
# database_path = "../Resources/Census_Data.sqlite"

In [2]:
# Create an engine that can talk to the database
# engine = create_engine(f'postgresql+psycopg2://{username_password}@localhost:5432/employees_db_sql_challenge')
engine = create_engine(f'postgresql://{username_password}@localhost:5432/employees_db_sql_challenge')

#(f"sqlite:///{database_path}")
connection = engine.connect()

In [4]:
# Examine the tables
# Figure out how to pull in the salary table

# Query All Records in the the Database
# data = engine.execute("SELECT * FROM Census_Data")
# for record in data:
  #  print(record)

#Instead like:
data = pd.read_sql('SELECT * FROM salaries', connection)
# Then Preview like
data.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [5]:
data_titles = pd.read_sql('SELECT * FROM titles', connection)
data_titles.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer